fio/log/alfs_1st_sequential_write_log.txt
fio_test: (g=0): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
fio-2.2.8
Starting 1 thread
fio_test: Laying out IO file(s) (1 file(s) / 819200MB)

fio_test: (groupid=0, jobs=1): err= 0: pid=2725: Thu Jan 26 19:20:25 2017
  write: io=819200MB, bw=741644KB/s, iops=185410, runt=1131083msec
    slat (usec): min=1, max=2448.1K, avg= 2.96, stdev=181.25
    clat (usec): min=49, max=2917.4K, avg=685.04, stdev=3547.24
     lat (usec): min=59, max=4285.3K, avg=688.06, stdev=3563.94
    clat percentiles (usec):
     |  1.00th=[  406],  5.00th=[  414], 10.00th=[  422], 20.00th=[  438],
     | 30.00th=[  458], 40.00th=[  486], 50.00th=[  588], 60.00th=[  716],
     | 70.00th=[  820], 80.00th=[  924], 90.00th=[ 1004], 95.00th=[ 1048],
     | 99.00th=[ 1592], 99.50th=[ 2192], 99.90th=[ 2544], 99.95th=[ 6048],
     | 99.99th=[ 8640]
    bw (KB  /s): min=    0, max=788224, per=100.00%, avg=747879.28, stdev=102558.53
    lat (usec) : 50=0.01%, 100=0.01%, 250=0.01%, 500=41.93%, 750=21.23%
    lat (usec) : 1000=26.36%
    lat (msec) : 2=9.68%, 4=0.72%, 10=0.09%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2000=0.01%, >=2000=0.01%
  cpu          : usr=12.66%, sys=54.01%, ctx=10289471, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=209715200/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=819200MB, aggrb=741643KB/s, minb=741643KB/s, maxb=741643KB/s, mint=1131083msec, maxt=1131083msec

Disk stats (read/write):
  nvme0n1: ios=0/209728785, merge=0/566, ticks=0/123577641, in_queue=123632563, util=100.00%