fio/log/alfs_2nd_sequential_write_log.txt
fio_test: (g=0): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
fio-2.2.8
Starting 1 thread

fio_test: (groupid=0, jobs=1): err= 0: pid=2929: Thu Jan 26 19:39:02 2017
  write: io=819200MB, bw=751093KB/s, iops=187773, runt=1116854msec
    slat (usec): min=1, max=246911, avg= 2.58, stdev=26.85
    clat (usec): min=50, max=1875.2K, avg=678.76, stdev=2092.10
     lat (usec): min=54, max=1875.2K, avg=681.40, stdev=2092.26
    clat percentiles (usec):
     |  1.00th=[  370],  5.00th=[  382], 10.00th=[  390], 20.00th=[  410],
     | 30.00th=[  426], 40.00th=[  506], 50.00th=[  612], 60.00th=[  740],
     | 70.00th=[  860], 80.00th=[  980], 90.00th=[ 1032], 95.00th=[ 1080],
     | 99.00th=[ 1128], 99.50th=[ 1160], 99.90th=[ 1640], 99.95th=[ 6304],
     | 99.99th=[ 8384]
    bw (KB  /s): min=67390, max=785104, per=100.00%, avg=753049.98, stdev=26461.66
    lat (usec) : 100=0.01%, 250=0.01%, 500=39.34%, 750=21.48%, 1000=22.42%
    lat (msec) : 2=16.68%, 4=0.01%, 10=0.09%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%, 2000=0.01%
  cpu          : usr=13.11%, sys=48.20%, ctx=11733458, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=209715200/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=819200MB, aggrb=751092KB/s, minb=751092KB/s, maxb=751092KB/s, mint=1116854msec, maxt=1116854msec

Disk stats (read/write):
  nvme0n1: ios=0/209709220, merge=0/121, ticks=0/124736683, in_queue=124761336, util=100.00%