fio/log/alfs_3rd_random_write_log.txt
fio_test: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
fio-2.2.8
Starting 8 threads

fio_test: (groupid=0, jobs=1): err= 0: pid=3121: Fri Jan 27 04:32:39 2017
  write: io=819200MB, bw=26198KB/s, iops=6549, runt=32020312msec
    slat (usec): min=1, max=6654, avg= 6.42, stdev= 5.50
    clat (usec): min=912, max=135760, avg=19536.52, stdev=15298.06
     lat (usec): min=919, max=135771, avg=19543.02, stdev=15298.07
    clat percentiles (usec):
     |  1.00th=[ 2800],  5.00th=[ 8032], 10.00th=[ 9664], 20.00th=[10176],
     | 30.00th=[10432], 40.00th=[10944], 50.00th=[11456], 60.00th=[12224],
     | 70.00th=[14400], 80.00th=[42240], 90.00th=[46336], 95.00th=[47872],
     | 99.00th=[55040], 99.50th=[63232], 99.90th=[70144], 99.95th=[75264],
     | 99.99th=[83456]
    bw (KB  /s): min= 8922, max=107488, per=12.51%, avg=26221.71, stdev=7041.20
    lat (usec) : 1000=0.01%
    lat (msec) : 2=0.01%, 4=2.13%, 10=14.67%, 20=58.16%, 50=22.76%
    lat (msec) : 100=2.28%, 250=0.01%
  cpu          : usr=0.93%, sys=5.23%, ctx=55911182, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=209715200/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=3122: Fri Jan 27 04:32:39 2017
  write: io=819200MB, bw=26216KB/s, iops=6554, runt=31997959msec
    slat (usec): min=1, max=6525, avg= 6.41, stdev= 5.50
    clat (msec): min=1, max=130, avg=19.52, stdev=15.29
     lat (msec): min=1, max=130, avg=19.53, stdev=15.29
    clat percentiles (usec):
     |  1.00th=[ 2800],  5.00th=[ 8032], 10.00th=[ 9664], 20.00th=[10176],
     | 30.00th=[10432], 40.00th=[10944], 50.00th=[11456], 60.00th=[12224],
     | 70.00th=[14400], 80.00th=[42240], 90.00th=[46336], 95.00th=[47872],
     | 99.00th=[55040], 99.50th=[63232], 99.90th=[70144], 99.95th=[75264],
     | 99.99th=[83456]
    bw (KB  /s): min=10371, max=109856, per=12.52%, avg=26240.24, stdev=7050.24
    lat (msec) : 2=0.01%, 4=2.13%, 10=14.66%, 20=58.22%, 50=22.71%
    lat (msec) : 100=2.28%, 250=0.01%
  cpu          : usr=0.93%, sys=5.22%, ctx=55942708, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=209715200/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=3123: Fri Jan 27 04:32:39 2017
  write: io=819200MB, bw=26196KB/s, iops=6549, runt=32022434msec
    slat (usec): min=1, max=6992, avg= 6.41, stdev= 5.52
    clat (usec): min=306, max=130469, avg=19537.82, stdev=15301.67
     lat (usec): min=312, max=130482, avg=19544.31, stdev=15301.68
    clat percentiles (usec):
     |  1.00th=[ 2800],  5.00th=[ 8032], 10.00th=[ 9664], 20.00th=[10176],
     | 30.00th=[10432], 40.00th=[10944], 50.00th=[11456], 60.00th=[12224],
     | 70.00th=[14528], 80.00th=[42240], 90.00th=[46336], 95.00th=[47872],
     | 99.00th=[55040], 99.50th=[63232], 99.90th=[71168], 99.95th=[75264],
     | 99.99th=[83456]
    bw (KB  /s): min= 9446, max=181502, per=12.51%, avg=26218.37, stdev=7121.44
    lat (usec) : 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=2.14%, 10=14.67%, 20=58.12%, 50=22.78%
    lat (msec) : 100=2.27%, 250=0.01%
  cpu          : usr=0.93%, sys=5.22%, ctx=55892994, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=209715200/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=3124: Fri Jan 27 04:32:39 2017
  write: io=819200MB, bw=26204KB/s, iops=6551, runt=32012283msec
    slat (usec): min=1, max=6801, avg= 6.42, stdev= 5.52
    clat (usec): min=826, max=135459, avg=19531.63, stdev=15292.53
     lat (usec): min=831, max=135462, avg=19538.11, stdev=15292.55
    clat percentiles (usec):
     |  1.00th=[ 2800],  5.00th=[ 8032], 10.00th=[ 9664], 20.00th=[10176],
     | 30.00th=[10432], 40.00th=[10944], 50.00th=[11456], 60.00th=[12224],
     | 70.00th=[14400], 80.00th=[42240], 90.00th=[46336], 95.00th=[47872],
     | 99.00th=[55040], 99.50th=[63232], 99.90th=[70144], 99.95th=[74240],
     | 99.99th=[83456]
    bw (KB  /s): min= 8804, max=108912, per=12.52%, avg=26228.42, stdev=7035.28
    lat (usec) : 1000=0.01%
    lat (msec) : 2=0.01%, 4=2.13%, 10=14.63%, 20=58.21%, 50=22.74%
    lat (msec) : 100=2.28%, 250=0.01%
  cpu          : usr=0.93%, sys=5.22%, ctx=55914141, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=209715200/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=3125: Fri Jan 27 04:32:39 2017
  write: io=819200MB, bw=26201KB/s, iops=6550, runt=32015924msec
    slat (usec): min=1, max=4791, avg= 6.42, stdev= 5.45
    clat (usec): min=782, max=130307, avg=19533.85, stdev=15293.16
     lat (usec): min=787, max=130313, avg=19540.34, stdev=15293.17
    clat percentiles (usec):
     |  1.00th=[ 2800],  5.00th=[ 8032], 10.00th=[ 9664], 20.00th=[10176],
     | 30.00th=[10432], 40.00th=[10944], 50.00th=[11456], 60.00th=[12224],
     | 70.00th=[14528], 80.00th=[42240], 90.00th=[46336], 95.00th=[47872],
     | 99.00th=[55040], 99.50th=[63232], 99.90th=[71168], 99.95th=[75264],
     | 99.99th=[83456]
    bw (KB  /s): min=10448, max=109936, per=12.51%, avg=26225.23, stdev=7018.55
    lat (usec) : 1000=0.01%
    lat (msec) : 2=0.01%, 4=2.12%, 10=14.65%, 20=58.20%, 50=22.75%
    lat (msec) : 100=2.28%, 250=0.01%
  cpu          : usr=0.94%, sys=5.22%, ctx=55950072, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=209715200/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=3126: Fri Jan 27 04:32:39 2017
  write: io=819200MB, bw=26198KB/s, iops=6549, runt=32020434msec
    slat (usec): min=1, max=6195, avg= 6.42, stdev= 5.50
    clat (msec): min=1, max=124, avg=19.54, stdev=15.29
     lat (msec): min=1, max=124, avg=19.54, stdev=15.29
    clat percentiles (usec):
     |  1.00th=[ 2800],  5.00th=[ 8032], 10.00th=[ 9664], 20.00th=[10176],
     | 30.00th=[10432], 40.00th=[10944], 50.00th=[11456], 60.00th=[12224],
     | 70.00th=[14528], 80.00th=[42240], 90.00th=[46336], 95.00th=[47872],
     | 99.00th=[55040], 99.50th=[63232], 99.90th=[71168], 99.95th=[75264],
     | 99.99th=[84480]
    bw (KB  /s): min= 9760, max=110248, per=12.51%, avg=26221.51, stdev=7064.86
    lat (msec) : 2=0.01%, 4=2.14%, 10=14.64%, 20=58.17%, 50=22.77%
    lat (msec) : 100=2.27%, 250=0.01%
  cpu          : usr=0.93%, sys=5.22%, ctx=55944845, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=209715200/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=3127: Fri Jan 27 04:32:39 2017
  write: io=819200MB, bw=26212KB/s, iops=6553, runt=32002622msec
    slat (usec): min=1, max=7859, avg= 6.42, stdev= 5.53
    clat (usec): min=506, max=126944, avg=19525.73, stdev=15294.74
     lat (usec): min=510, max=126947, avg=19532.22, stdev=15294.75
    clat percentiles (usec):
     |  1.00th=[ 2800],  5.00th=[ 8032], 10.00th=[ 9664], 20.00th=[10176],
     | 30.00th=[10432], 40.00th=[10944], 50.00th=[11456], 60.00th=[12224],
     | 70.00th=[14400], 80.00th=[42240], 90.00th=[46336], 95.00th=[47872],
     | 99.00th=[55040], 99.50th=[63232], 99.90th=[71168], 99.95th=[75264],
     | 99.99th=[84480]
    bw (KB  /s): min=11073, max=109104, per=12.52%, avg=26236.34, stdev=7050.86
    lat (usec) : 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=2.13%, 10=14.67%, 20=58.19%, 50=22.71%
    lat (msec) : 100=2.29%, 250=0.01%
  cpu          : usr=0.94%, sys=5.22%, ctx=55898133, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=209715200/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=3128: Fri Jan 27 04:32:39 2017
  write: io=819200MB, bw=26214KB/s, iops=6553, runt=32000982msec
    slat (usec): min=1, max=6945, avg= 6.42, stdev= 5.51
    clat (msec): min=1, max=124, avg=19.52, stdev=15.29
     lat (msec): min=1, max=124, avg=19.53, stdev=15.29
    clat percentiles (usec):
     |  1.00th=[ 2800],  5.00th=[ 8032], 10.00th=[ 9664], 20.00th=[10176],
     | 30.00th=[10432], 40.00th=[10944], 50.00th=[11456], 60.00th=[12224],
     | 70.00th=[14400], 80.00th=[42240], 90.00th=[46336], 95.00th=[47872],
     | 99.00th=[55040], 99.50th=[63232], 99.90th=[71168], 99.95th=[75264],
     | 99.99th=[84480]
    bw (KB  /s): min=10557, max=108880, per=12.52%, avg=26237.82, stdev=7051.95
    lat (msec) : 2=0.01%, 4=2.14%, 10=14.64%, 20=58.21%, 50=22.73%
    lat (msec) : 100=2.27%, 250=0.01%
  cpu          : usr=0.93%, sys=5.23%, ctx=55916974, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=209715200/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=6400.0GB, aggrb=209568KB/s, minb=26196KB/s, maxb=26216KB/s, mint=31997959msec, maxt=32022434msec

Disk stats (read/write):
  nvme0n1: ios=0/1677716488, merge=0/0, ticks=0/2648929360, in_queue=3687069987, util=100.00%